# St7EnableTransientFreedomCase

Enables the specified freedom case for quasi-static and transient dynamic analysis.

long St7EnableTransientFreedomCase(long uID, long CaseNum)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Freedom case number.